
#define _SUPPRESS_PLIB_WARNING
#include "audio.h"
#include <plib.h>
#include "composite32-high4.h"
#include "lib_composite32-high.h"
#include <stdint.h>

//外付けクリスタル with PLL (15倍)
#pragma config PMDL1WAY = OFF, IOL1WAY = OFF
#pragma config FPLLIDIV = DIV_1, FPLLMUL = MUL_15, FPLLODIV = DIV_1
#pragma config FNOSC = PRIPLL, FSOSCEN = OFF, POSCMOD = XT, OSCIOFNC = OFF
#pragma config FPBDIV = DIV_1, FWDTEN = OFF, JTAGEN = OFF, ICESEL = ICS_PGx1

#define SAMPLING_FREQ 32000
#define OUTPUT_FREQ 100000
#define CLOCK_FREQ 53800000


typedef unsigned int uint;

void audiotask(void);

//sounddata配列　低いド?3オクターブ分の周期カウンタ値、PR3に書き込むと音程設定される
unsigned char sounddata[SIZEOFSOUNDBF]={0};

const music_dat_t part1[]={
#include "humen.h"
};
const music_dat_t part2[]={
    {240,240,40,100},
{480,240,52,100},
{720,240,40,100},
{960,240,52,100},
{1200,240,40,100},
{1440,240,52,100},
{1680,240,40,100},
{1920,240,52,100},
{2160,240,45,100},
{2400,240,57,100},
{2640,240,45,100},
{2880,240,57,100},
{3120,240,45,100},
{3360,240,57,100},
{3600,240,45,100},
{3840,240,57,100},
{4080,120,44,100},
{4200,120,44,100},
{4320,120,56,100},
{4560,240,44,100},
{4800,240,56,100},
{5040,240,40,100},
{5280,240,52,100},
{5520,240,40,100},
{5760,240,52,100},
{6000,240,45,100},
{6240,240,57,100},
{6480,240,45,100},
{6720,240,57,100},
{6960,240,45,100},
{7200,240,57,100},
{7440,240,47,100},
{7680,240,48,100},
{7920,240,50,100},
{8160,240,38,100},
{8640,240,38,100},
{9120,240,38,100},
{9360,240,45,100},
{9600,240,43,100},
{9840,240,36,100},
{10080,240,48,100},
{10560,240,48,100},
{10800,240,36,100},
{11040,240,45,100},
{11280,240,43,100},
{11760,240,47,100},
{12000,240,59,100},
{12480,240,59,100},
{12960,240,52,100},
{13200,240,44,100},
{13440,240,52,100},
{13680,240,45,100},
{13920,240,52,100},
{14160,240,45,100},
{14400,240,52,100},
{14640,480,45,100},
{15600,240,40,100},
{15840,240,52,100},
{16080,240,40,100},
{16320,240,52,100},
{16560,240,40,100},
{16800,240,52,100},
{17040,240,40,100},
{17280,240,52,100},
{17520,240,45,100},
{17760,240,57,100},
{18000,240,45,100},
{18240,240,57,100},
{18480,240,45,100},
{18720,240,57,100},
{18960,240,45,100},
{19200,240,57,100},
{19440,120,44,100},
{19560,120,44,100},
{19680,120,56,100},
{19920,240,44,100},
{20160,240,56,100},
{20400,240,40,100},
{20640,240,52,100},
{20880,240,40,100},
{21120,240,52,100},
{21360,240,45,100},
{21600,240,57,100},
{21840,240,45,100},
{22080,240,57,100},
{22320,240,45,100},
{22560,240,57,100},
{22800,240,47,100},
{23040,240,48,100},
{23280,240,50,100},
{23520,240,38,100},
{24000,240,38,100},
{24480,240,38,100},
{24720,240,45,100},
{24960,240,43,100},
{25200,240,36,100},
{25440,240,48,100},
{25920,240,48,100},
{26160,240,36,100},
{26400,240,45,100},
{26640,240,43,100},
{27120,240,47,100},
{27360,240,59,100},
{27840,240,59,100},
{28320,240,52,100},
{28560,240,44,100},
{28800,240,52,100},
{29040,240,45,100},
{29280,240,52,100},
{29520,240,45,100},
{29760,240,52,100},
{30000,480,45,100},
{30960,240,45,100},
{31200,240,52,100},
{31440,240,45,100},
{31680,240,52,100},
{31920,240,45,100},
{32160,120,52,100},
{32280,120,52,100},
{32400,240,45,100},
{32640,240,52,100},
{32880,240,44,100},
{33120,240,52,100},
{33360,240,44,100},
{33600,240,52,100},
{33840,240,44,100},
{34080,240,52,100},
{34320,240,44,100},
{34560,240,52,100},
{34800,240,45,100},
{35040,240,52,100},
{35280,240,45,100},
{35520,240,52,100},
{35760,240,45,100},
{36000,120,52,100},
{36120,120,52,100},
{36240,240,45,100},
{36480,240,52,100},
{36720,240,44,100},
{36960,240,52,100},
{37200,240,44,100},
{37440,240,52,100},
{38640,240,45,100},
{38880,240,52,100},
{39120,240,45,100},
{39360,240,52,100},
{39600,240,45,100},
{39840,120,52,100},
{39960,120,52,100},
{40080,240,45,100},
{40320,240,52,100},
{40560,240,44,100},
{40800,240,52,100},
{41040,240,44,100},
{41280,240,52,100},
{41520,240,44,100},
{41760,240,52,100},
{42000,240,44,100},
{42240,240,52,100},
{42480,240,45,100},
{42720,240,52,100},
{42960,240,45,100},
{43200,240,52,100},
{43440,240,45,100},
{43680,240,52,100},
{43920,240,45,100},
{44160,240,52,100},
{44400,240,44,100},
{44640,240,52,100},
{44880,240,44,100},
{45120,240,52,100},

};

void main(void){
  int i;

  //ポートの初期設定
  TRISA = 0x0010; // RA4は入力
  CNPUA = 0x0010; // RA4をプルアップ
  ANSELA = 0x0000; // 全てデジタル
  TRISB = KEYSTART | KEYFIRE | KEYUP | KEYDOWN | KEYLEFT | KEYRIGHT;// ボタン接続ポート入力設定
  CNPUBSET=KEYSTART | KEYFIRE | KEYUP | KEYDOWN | KEYLEFT | KEYRIGHT;// プルアップ設定
  ANSELB = 0x0000; // 全てデジタル
  LATACLR=2;// RA1=0（ボタンモード）

  RPB13R=5;//RPB13ピンにOC4を割り当て
  OC4R=0;
  OC4CON=0x000e;// Timer3ベース、PWMモード
  OC4CONSET=0x8000;//OC4スタート
  T3CON=0x0000;// プリスケーラ1:1
  PR3=256;
  T3CONSET=0x8000;// タイマ3スタート
    
  T4CONbits.SIDL = 0;
  T4CONbits.TCKPS = 3;
  T4CONbits.T32 = 0;
  T4CONbits.TCS = 0;
  TMR4 = 0;/*とりあえず和音を再生しました。ソースを公開します。ハードは同じで多分大丈夫ですが心配ならローパスフィルターを入れてください。割り込みなどは一切使っていません。
コードはリファクタリングしておきます。*/
  PR4 = CLOCK_FREQ / 8 / SAMPLING_FREQ;
  T4CONbits.ON = 1;
    
  DmaChnOpen(0, 0, DMA_OPEN_AUTO);

  DmaChnSetEventControl(0, DMA_EV_START_IRQ(_TIMER_4_IRQ));
 
  DmaChnSetTxfer(0, sounddata, (void*)&OC4RS, sizeof(sounddata), 1, 1);
 
  DmaChnEnable(0);
    
  init_composite(); // ビデオ出力システムの初期化

  unsigned int timing[2];
  unsigned int time;
  int pos[2]={0};
  const music_dat_t *part;
  mktone(1,1,1,1);
  mktone(1,1,1,0);

  for(i=0;i<2;i++){
          part = i?part1:part2;
      timing[i] = part[pos[i]].time*12;
  }
  while(1){
      time = gettime();
      for(i=0;i<2;i++){
          part = i?part2:part1;
        if(time>-SAMPLING_FREQ/40+timing[i]){
            addNextSound(timing[i],part[pos[i]].key,part[pos[i]].len*1000*25/SAMPLING_FREQ/* *3/4 */-10,part[pos[i]].vel+120,i);
            pos[i]++;
            timing[i] = part[pos[i]].time*25;
        }if(part[pos[i]].time==-1){pos[0]=0;pos[1]=0;settime(0);timing[0]=3000;timing[1]=3000;}
      }
      
      audiotask();      

      drawcount=0;
      
      while(!drawcount);
  }
}


void audiotask(void){
  static uint prevtrans=1;
  uint8_t *buff;

#ifdef SIMMODE
  buff = &sounddata[0];
#else
  buff = NULL;//&sounddata[0];
#endif
  if(DmaChnGetEvFlags(0)&DMA_EV_SRC_HALF){
    DmaChnClrEvFlags(0,DMA_EV_SRC_HALF);
    if(prevtrans==2){
      prevtrans=1;
      buff = &sounddata[0];
    }
  }else if(DmaChnGetEvFlags(0)&DMA_EV_SRC_FULL){
    DmaChnClrEvFlags(0,DMA_EV_SRC_FULL);
    if(prevtrans==1){
      prevtrans=2;
      buff = &sounddata[SIZEOFSOUNDBF/2];
    }
  }

  if(buff){
      int i;
      for(i=0;i<SIZEOFSOUNDBF/2;i++){
          buff[i]=128;
      }
      soundTask(buff);
  }
}
